grevaillot/svd_tools/headers/STM32F301/can.h
#define CAN_TDH0R_DATA6_SHIFT		16
#define CAN_TDH0R_DATA6_MASK		0xff
/** @defgroup can_tdh0r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN_TDH0R_DATA5_SHIFT		8
#define CAN_TDH0R_DATA5_MASK		0xff
/** @defgroup can_tdh0r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN_TDH0R_DATA4_SHIFT		0
#define CAN_TDH0R_DATA4_MASK		0xff
/** @defgroup can_tdh0r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can_ti1r TI1R TX mailbox identifier register
@{*/


#define CAN_TI1R_STID_SHIFT		21
#define CAN_TI1R_STID_MASK		0x7ff
/** @defgroup can_ti1r_stid STID STID
@{*/
/**@}*/


#define CAN_TI1R_EXID_SHIFT		3
#define CAN_TI1R_EXID_MASK		0x3ffff
/** @defgroup can_ti1r_exid EXID EXID
@{*/
/**@}*/

/** CAN_TI1R_IDE IDE **/
#define CAN_TI1R_IDE		(1 << 2)
/** CAN_TI1R_RTR RTR **/
#define CAN_TI1R_RTR		(1 << 1)
/** CAN_TI1R_TXRQ TXRQ **/
#define CAN_TI1R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can_tdt1r TDT1R mailbox data length control and time stamp register
@{*/


#define CAN_TDT1R_TIME_SHIFT		16
#define CAN_TDT1R_TIME_MASK		0xffff
/** @defgroup can_tdt1r_time TIME TIME
@{*/
/**@}*/

/** CAN_TDT1R_TGT TGT **/
#define CAN_TDT1R_TGT		(1 << 8)

#define CAN_TDT1R_DLC_SHIFT		0
#define CAN_TDT1R_DLC_MASK		0x0f
/** @defgroup can_tdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can_tdl1r TDL1R mailbox data low register
@{*/


#define CAN_TDL1R_DATA3_SHIFT		24
#define CAN_TDL1R_DATA3_MASK		0xff
/** @defgroup can_tdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN_TDL1R_DATA2_SHIFT		16
#define CAN_TDL1R_DATA2_MASK		0xff
/** @defgroup can_tdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN_TDL1R_DATA1_SHIFT		8
#define CAN_TDL1R_DATA1_MASK		0xff
/** @defgroup can_tdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN_TDL1R_DATA0_SHIFT		0
#define CAN_TDL1R_DATA0_MASK		0xff
/** @defgroup can_tdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_tdh1r TDH1R mailbox data high register
@{*/


#define CAN_TDH1R_DATA7_SHIFT		24
#define CAN_TDH1R_DATA7_MASK		0xff
/** @defgroup can_tdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN_TDH1R_DATA6_SHIFT		16
#define CAN_TDH1R_DATA6_MASK		0xff
/** @defgroup can_tdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN_TDH1R_DATA5_SHIFT		8
#define CAN_TDH1R_DATA5_MASK		0xff
/** @defgroup can_tdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN_TDH1R_DATA4_SHIFT		0
#define CAN_TDH1R_DATA4_MASK		0xff
/** @defgroup can_tdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can_ti2r TI2R TX mailbox identifier register
@{*/


#define CAN_TI2R_STID_SHIFT		21
#define CAN_TI2R_STID_MASK		0x7ff
/** @defgroup can_ti2r_stid STID STID
@{*/
/**@}*/


#define CAN_TI2R_EXID_SHIFT		3
#define CAN_TI2R_EXID_MASK		0x3ffff
/** @defgroup can_ti2r_exid EXID EXID
@{*/
/**@}*/

/** CAN_TI2R_IDE IDE **/
#define CAN_TI2R_IDE		(1 << 2)
/** CAN_TI2R_RTR RTR **/
#define CAN_TI2R_RTR		(1 << 1)
/** CAN_TI2R_TXRQ TXRQ **/
#define CAN_TI2R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can_tdt2r TDT2R mailbox data length control and time stamp register
@{*/


#define CAN_TDT2R_TIME_SHIFT		16
#define CAN_TDT2R_TIME_MASK		0xffff
/** @defgroup can_tdt2r_time TIME TIME
@{*/
/**@}*/

/** CAN_TDT2R_TGT TGT **/
#define CAN_TDT2R_TGT		(1 << 8)

#define CAN_TDT2R_DLC_SHIFT		0
#define CAN_TDT2R_DLC_MASK		0x0f
/** @defgroup can_tdt2r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can_tdl2r TDL2R mailbox data low register
@{*/


#define CAN_TDL2R_DATA3_SHIFT		24
#define CAN_TDL2R_DATA3_MASK		0xff
/** @defgroup can_tdl2r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN_TDL2R_DATA2_SHIFT		16
#define CAN_TDL2R_DATA2_MASK		0xff
/** @defgroup can_tdl2r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN_TDL2R_DATA1_SHIFT		8
#define CAN_TDL2R_DATA1_MASK		0xff
/** @defgroup can_tdl2r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN_TDL2R_DATA0_SHIFT		0
#define CAN_TDL2R_DATA0_MASK		0xff
/** @defgroup can_tdl2r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_tdh2r TDH2R mailbox data high register
@{*/


#define CAN_TDH2R_DATA7_SHIFT		24
#define CAN_TDH2R_DATA7_MASK		0xff
/** @defgroup can_tdh2r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN_TDH2R_DATA6_SHIFT		16
#define CAN_TDH2R_DATA6_MASK		0xff
/** @defgroup can_tdh2r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN_TDH2R_DATA5_SHIFT		8
#define CAN_TDH2R_DATA5_MASK		0xff
/** @defgroup can_tdh2r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN_TDH2R_DATA4_SHIFT		0
#define CAN_TDH2R_DATA4_MASK		0xff
/** @defgroup can_tdh2r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can_ri0r RI0R receive FIFO mailbox identifier register
@{*/


#define CAN_RI0R_STID_SHIFT		21
#define CAN_RI0R_STID_MASK		0x7ff
/** @defgroup can_ri0r_stid STID STID
@{*/
/**@}*/


#define CAN_RI0R_EXID_SHIFT		3
#define CAN_RI0R_EXID_MASK		0x3ffff
/** @defgroup can_ri0r_exid EXID EXID
@{*/
/**@}*/

/** CAN_RI0R_IDE IDE **/
#define CAN_RI0R_IDE		(1 << 2)
/** CAN_RI0R_RTR RTR **/
#define CAN_RI0R_RTR		(1 << 1)

/**@}*/

/** @defgroup can_rdt0r RDT0R receive FIFO mailbox data length control and time stamp register
@{*/


#define CAN_RDT0R_TIME_SHIFT		16
#define CAN_RDT0R_TIME_MASK		0xffff
/** @defgroup can_rdt0r_time TIME TIME
@{*/
/**@}*/


#define CAN_RDT0R_FMI_SHIFT		8
#define CAN_RDT0R_FMI_MASK		0xff
/** @defgroup can_rdt0r_fmi FMI FMI
@{*/
/**@}*/


#define CAN_RDT0R_DLC_SHIFT		0
#define CAN_RDT0R_DLC_MASK		0x0f
/** @defgroup can_rdt0r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can_rdl0r RDL0R receive FIFO mailbox data low register
@{*/


#define CAN_RDL0R_DATA3_SHIFT		24
#define CAN_RDL0R_DATA3_MASK		0xff
/** @defgroup can_rdl0r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN_RDL0R_DATA2_SHIFT		16
#define CAN_RDL0R_DATA2_MASK		0xff
/** @defgroup can_rdl0r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN_RDL0R_DATA1_SHIFT		8
#define CAN_RDL0R_DATA1_MASK		0xff
/** @defgroup can_rdl0r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN_RDL0R_DATA0_SHIFT		0
#define CAN_RDL0R_DATA0_MASK		0xff
/** @defgroup can_rdl0r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_rdh0r RDH0R receive FIFO mailbox data high register
@{*/


#define CAN_RDH0R_DATA7_SHIFT		24
#define CAN_RDH0R_DATA7_MASK		0xff
/** @defgroup can_rdh0r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN_RDH0R_DATA6_SHIFT		16
#define CAN_RDH0R_DATA6_MASK		0xff
/** @defgroup can_rdh0r_data6 DATA6 DATA6
@{*/
/**@}*/


